#include"Graphical.h" 
#include"mylib.h"
#include"keyboard.h"
#include"filetest.h"

int main()
{
	int value,flag=1;
	printf( "*******************************************************************************\n" 
 		    "                         欢迎来到北京锤雷银行                                  \n"
 		    "                                                    编写人员：黄锐 周尧棋 朱魁 \n"
 		    "*******************************************************************************\n"
		    "                        请选择银行的界面版本:                                  \n"
	        "                        输入 1 进入文件版界面                                  \n"
	        "                        输入 2 进入键盘版界面                                  \n" 
	        "                        输入 3 进入图形化界面                                  \n"
		    "*******************************************************************************\n");
    scanf("%d",&value);
    if(value==1||value==2||value==3)
        flag=0;
    while(flag)
    {
    	printf("您的操作有误，请重新输入:\n");
    	scanf("%d",&value);
    	if(value==1||value==2||value==3)
            flag=0;
        else
            flag=1;
    }
    system("cls"); 
    printf( "*******************************************************************************\n" 
 		    "                         欢迎来到北京锤雷银行                                  \n"
 		    "                                                    编写人员：黄锐 周尧棋 朱魁 \n"
 		    "*******************************************************************************\n"); 
    if(value==1)
        file();
    else if(value==2)
        keyboard();
    else if(value==3)
        graphical();
    system("pause");
    return 0;
}
